import style from "@/styles/home/services.module.css";
import Heading from "@/components/Heading";
import Image from "next/image";

const Services = () => {
  const serv = [
    {
      icon: "/",
      title: "التوثيق",
      description:
        "يقدم المكتب كافة خدمات التوثيق خلال أيام الأسبوع وعلى مدار 24 ساعه وخلال وخارج الدوام الرسمي وأيام الإجازات الرسمية سواء في مقر المكتب أو مقر طالب الخدمة ومنها خدمة إفراغ العقارات وإصدار الوكالات وفسخها وتوثيق عقود الشركات وقرارات التعديل.",
    },
    {
      icon: "/",
      title: "العقود والاتفاقيات",
      description:
        "يقوم المكتب بإعداد ومراجعة العقود والاتفاقيات التي يكون العميل طرفاً فيها، وذلك من خلال نخبة من المستشارين والمتخصصين في مختلف أنواع العقود، ومن ذلك عقود المشاركات والتمويل والاستثمار والمقاولات وغيرها.",
    },
    {
      icon: "/",
      title: "تأسيس وتسجيل الشركات",
      description:
        "للمكتب خبرة في تأسيس وتسجيل الشركات التجارية بجميع أنواعها، وإدارة الجمعيات التأسيسية والعمومية للشركات المساهمة، وإعداد وتوثيق عقود التأسيس وملاحق التعديل، وإعداد اللوائح الداخلية ولوائح الحوكمة، كما نقوم بمساعدة العملاء في اختيار الشكل القانوني المناسب للشركة.",
    },
    {
      icon: "/",
      title: "تأسيس وتسجيل الشركات",
      description:
        "للمكتب خبرة في تأسيس وتسجيل الشركات التجارية بجميع أنواعها، وإدارة الجمعيات التأسيسية والعمومية للشركات المساهمة، وإعداد وتوثيق عقود التأسيس وملاحق التعديل، وإعداد اللوائح الداخلية ولوائح الحوكمة، كما نقوم بمساعدة العملاء في اختيار الشكل القانوني المناسب للشركة.",
    },
    {
      icon: "/",
      title: "تأسيس وتسجيل الشركات",
      description:
        "للمكتب خبرة في تأسيس وتسجيل الشركات التجارية بجميع أنواعها، وإدارة الجمعيات التأسيسية والعمومية للشركات المساهمة، وإعداد وتوثيق عقود التأسيس وملاحق التعديل، وإعداد اللوائح الداخلية ولوائح الحوكمة، كما نقوم بمساعدة العملاء في اختيار الشكل القانوني المناسب للشركة.",
    },
    {
      icon: "/",
      title: "تأسيس وتسجيل الشركات",
      description:
        "للمكتب خبرة في تأسيس وتسجيل الشركات التجارية بجميع أنواعها، وإدارة الجمعيات التأسيسية والعمومية للشركات المساهمة، وإعداد وتوثيق عقود التأسيس وملاحق التعديل، وإعداد اللوائح الداخلية ولوائح الحوكمة، كما نقوم بمساعدة العملاء في اختيار الشكل القانوني المناسب للشركة.",
    },
  ];
  return (
    <div className={style.content}>
      <div className={style.container}>
        <Heading
          topHeading={"خدماتنا القانونية الشاملة"}
          subHeading={
            "نوفر في مكتب المحامي موسى النشمي الحماية القانونية للشركات المحلية والأجنبية والأفراد، ونقدم الاستشارات القانونية في مختلف المجالات. بالإضافة إلى تقديم الخدمات القانونية لقطاع الأعمال من خلال حلفاءنا الدوليين. كما نقوم بالمرافعة والمدافعة نيابة عن عملائنا في جميع المنازعات و القضايا لتغطية الحماية القانونية اللازمة للجميع."
          }
          centerHeading={true}
          showSubHeading={true}
          showBotHeading={true}
          showBotHeadingn={false}
        />
        <div className={style.cards}>
          {serv.map((card, index) => (
            <div className={style.card} key={index}>
              <div className={style.icon}>
                <Image
                  src={"/images/touch.png"}
                  alt="pic"
                  width={70}
                  height={70}
                />
              </div>
              <div className={style.title}>
                <h1>{card.title}</h1>
              </div>
              <div className={style.description}>
                <p>{card.description}</p>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Services;
